-- 按分数由高到低进行排行
-- 使用临时表 tmp 统计比当前分数高的行数即为当前分数的排名, 然后按分数由高到低排序
-- 排名前                           排名后
-- +----+-------+                   +-------+------+
-- | Id | Score |                   | Score | Rank |
-- +----+-------+                   +-------+------+
-- | 1  | 3.50  |                   | 4.00  | 1    |
-- | 2  | 3.65  |  -------------->  | 4.00  | 1    |
-- | 3  | 4.00  |                   | 3.85  | 2    |
-- | 4  | 3.85  |                   | 3.65  | 3    |
-- | 5  | 4.00  |                   | 3.65  | 3    |
-- | 6  | 3.65  |                   | 3.50  | 4    |
-- +----+-------+                   +-------+------+
select
  Score,
  (select count(*) from (select distinct Score s from Scores) tmp where s >= Score) Rank
from Scores
order by Score desc
